#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

ephemeral.random_password.write_only_password: Opening...
ephemeral.random_password.write_only_password: Opening complete after 0s
data.aws_caller_identity.current: Reading...
aws_kms_key.local_key: Refreshing state... [id=4c6a43aa-3a8b-4c22-baab-7d2bf48af451]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_kms_alias.key: Refreshing state... [id=alias/app-17]
aws_kms_key_policy.encrypt_kms: Refreshing state... [id=4c6a43aa-3a8b-4c22-baab-7d2bf48af451]
aws_secretsmanager_secret.write_only_secret: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:/app-17/write_only_secret-7ysdNZ]
aws_secretsmanager_secret.secret_one: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:app-17/secure_secret_one-7ysdNZ]
aws_secretsmanager_secret.db_secrets: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:app-17/secrets-iyorkY]
aws_secretsmanager_secret_version.write_only_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:/app-17/write_only_secret-7ysdNZ|terraform-20251216045837426700000004]
aws_secretsmanager_secret_version.secure_one_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:app-17/secure_secret_one-7ysdNZ|terraform-20251216045837432100000006]
aws_secretsmanager_secret_version.db_secrets_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:app-17/secrets-iyorkY|terraform-20251216210805097000000001]
ephemeral.aws_secretsmanager_secret_version.write_only_retrieved: Opening...
ephemeral.aws_secretsmanager_secret_version.write_only_retrieved: Opening complete after 0s
aws_ssm_parameter.retrieved_secret: Refreshing state... [id=/app-17/retrieved_secret]
ephemeral.aws_secretsmanager_secret_version.write_only_retrieved: Closing...
ephemeral.random_password.write_only_password: Closing...
ephemeral.aws_secretsmanager_secret_version.write_only_retrieved: Closing complete after 0s
ephemeral.random_password.write_only_password: Closing complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.db_secrets_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "db_secrets_version" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-2:743794601996:secret:app-17/secrets-iyorkY" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-2:743794601996:secret:app-17/secrets-iyorkY|terraform-20251216210805097000000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20251216210805097000000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.secure_one_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "secure_one_version" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-2:743794601996:secret:app-17/secure_secret_one-7ysdNZ" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-2:743794601996:secret:app-17/secure_secret_one-7ysdNZ|terraform-20251216045837432100000006" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20251216045837432100000006" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*